{
  "BattleAbilities": {
    "seasonsgift": {
      "desc": "If Sunny Day is active, this Pokemon's Attack is 1.5x, and its Speed is doubled.",
      "shortDesc": "If Sunny Day is active, this Pokemon's Attack is 1.5x and its Speed is doubled.",
      "id": "seasonsgift",
      "name": "Season's Gift",
      "isNonstandard": true
    },
    "regrowth": {
      "desc": "This Pokemon's healing moves have their priority increased by one stage. When switching out, this Pokemon restores 1/4 of its maximum HP, rounded down.",
      "shortDesc": "Healing moves have priority increased by 1. Heals 1/4 max HP when switching out.",
      "id": "regrowth",
      "name": "Regrowth",
      "isNonstandard": true
    },
    "shellshocker": {
      "desc": "This Pokemon's Normal-type moves become Electric-type and have 1.2x power. In addition, this Pokemon is immune to Electric-type moves and heals 1/4 of its maximum HP, rounded down, when hit by an Electric-type move.",
      "shortDesc": "Normal-type moves become Electric with 1.2x power; Electric hits heal 1/4 max HP.",
      "id": "shellshocker",
      "name": "Shell Shocker",
      "isNonstandard": true,
      "onModifyMovePriority": -1,
      "onBasePowerPriority": 8
    },
    "logia": {
      "desc": "If this Pokemon is an Arceus, its type changes to match its held Plate or Z-Crystal, and it is immune to Normal and same-type moves.",
      "shortDesc": "Arceus: type matches held Plate or Z-Crystal; immunity to Normal and its own type.",
      "id": "logia",
      "name": "Logia",
      "isNonstandard": true
    },
    "stimulatedpride": {
      "id": "stimulatedpride",
      "name": "Stimulated Pride",
      "desc": "On switch-in, this Pokemon lowers the Attack of adjacent foes not behind a Substitute by one stage. If the weather is rain, this Pokemon's Speed is doubled.",
      "shortDesc": "On switch-in, adjacent foes' Atk is lowered by by 1. Speed is doubled in rain.",
      "isNonstandard": true
    },
    "learnsomethingnew": {
      "desc": "This Pokemon's Attack is raised by one stage when another Pokemon faints.",
      "shortDesc": "This Pokemon's Attack is raised by 1 stage when another Pokemon faints.",
      "id": "learnsomethingnew",
      "name": "Learn Something New!",
      "isNonstandard": true
    },
    "gracideamastery": {
      "desc": "If this Pokemon is a Shaymin, it will transform into Shaymin-S before using a physical or special attack. After using the attack, if this Pokemon was originally in its base forme, it will transform back into Shaymin.",
      "shortDesc": "Transforms into Shaymin-Sky before attacking, then reverts to Shaymin-Land.",
      "id": "gracideamastery",
      "name": "Gracidea Mastery",
      "isNonstandard": true
    },
    "lurking": {
      "desc": "This Pokemon's moves have their accuracy multiplied by 1.3.",
      "shortDesc": "This Pokemon's moves have their accuracy multiplied by 1.3.",
      "id": "lurking",
      "name": "Lurking",
      "isNonstandard": true
    },
    "adrenalinerush": {
      "desc": "As this Pokemon switches in, its Special Attack and Speed are doubled for 5 turns. After five turns have passed, these effects are removed.",
      "shortDesc": "On switch-in, this Pokemon's Special Attack and Speed are doubled for 5 turns.",
      "id": "adrenalinerush",
      "name": "Adrenaline Rush",
      "isNonstandard": true,
      "effect": {
        "duration": 5,
        "onModifySpAPriority": 5
      }
    },
    "starkmountain": {
      "desc": "The user summons Sunny Day when it switches in. In addition, Water-type attacks do halved damage against this Pokemon.",
      "shortDesc": "On switch-in, summons Sunny Day. Water power against this Pokemon is halved.",
      "id": "starkmountain",
      "name": "Stark Mountain",
      "isNonstandard": true
    },
    "scripter": {
      "desc": "If Scripted Terrain is active, this Pokemon's Speed is doubled, and its moves have 1.5x power.",
      "shortDesc": "If Scripted Terrain is active, this Pokemon's Speed doubles and attack power is 1.5x.",
      "id": "scripter",
      "name": "Scripter",
      "isNonstandard": true
    },
    "kungfupanda": {
      "desc": "This Pokemon's punch-based attacks have their power multiplied by 1.2, and this Pokemon's Speed is raised by 1 stage after it is damaged by a contact move.",
      "shortDesc": "This Pokemon's punch-based moves have 1.2x power. +1 Spe when a foe makes contact.",
      "id": "kungfupanda",
      "name": "Kung Fu Panda",
      "isNonstandard": true,
      "onBasePowerPriority": 8
    },
    "frozenskin": {
      "desc": "If hail is active, this Pokemon's Speed is doubled. This Pokemon takes no damage from hail.",
      "shortDesc": "If hail is active, this Pokemon's Speed is doubled; immunity to hail.",
      "id": "frozenskin",
      "name": "Frozen Skin",
      "isNonstandard": true
    },
    "standuptall": {
      "desc": "This Pokemon's Defense or Special Defense is raised by 1 stage at the end of each full turn it is on the field.",
      "shortDesc": "Raises Defense or Special Defense by 1, at random, after each full turn on the field.",
      "id": "standuptall",
      "name": "Stand Up Tall",
      "isNonstandard": true,
      "onResidualOrder": 26,
      "onResidualSubOrder": 1
    },
    "fakecrash": {
      "desc": "If this Pokemon is a Lycanroc-Midnight, the first hit it takes in battle deals 0 neutral damage. Its disguise is then broken, and it transforms into Lycanroc-Dusk. Confusion damage also breaks the disguise.",
      "shortDesc": "If this Pokemon is a Lycanroc-Midnight, the first hit it takes in battle deals 0 damage.",
      "id": "fakecrash",
      "name": "Fake Crash",
      "isNonstandard": true,
      "onDamagePriority": 1
    },
    "prismaticsurge": {
      "desc": "On switch-in, this Pokemon summons Prismatic Terrain.",
      "shortDesc": "On switch-in, this Pokemon summons Prismatic Terrain.",
      "id": "prismaticsurge",
      "name": "Prismatic Surge",
      "isNonstandard": true
    },
    "sacredshadow": {
      "desc": "This Pokemon's attacking stats are doubled while using a Ghost-type attack. If a Pokemon uses a Fire-type or Flying-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon. This Pokemon cannot be burned. Gaining this Ability while burned cures it.",
      "shortDesc": "This Pokemon's Ghost power is 2x; can't be burned; Fire/Flying power against it is halved.",
      "id": "sacredshadow",
      "name": "Sacred Shadow",
      "isNonstandard": true,
      "onModifyAtkPriority": 5,
      "onModifySpAPriority": 5
    },
    "fatrain": {
      "desc": "This Pokemon summons Rain Dance when it switches in, and its Defense is 1.5x when Rain is active.",
      "shortDesc": "On switch-in, summons Rain Dance. This Pokemon's Defense is 1.5x during Rain.",
      "id": "fatrain",
      "name": "Fat Rain",
      "isNonstandard": true
    },
    "wrath": {
      "desc": "This Pokemon has its critical hit ratio raised by 1 stage, and its moves have their accuracy multiplied by 1.1.",
      "shortDesc": "This Pokemon's critical hit ratio is raised by 1, and its moves have 1.1x accuracy.",
      "id": "wrath",
      "name": "Wrath",
      "isNonstandard": true
    },
    "recharge": {
      "desc": "Upon switching out, this Pokemon has its major status condition cured and restores 1/3 of its maximum HP, rounded down. When this Pokemon switches in, if it uses an Electric-type attack on the next turn, that attack's power will be doubled.",
      "shortDesc": "Switch-out: cures status + 33% HP. Switch-in: 2x power on Electric move next turn.",
      "id": "recharge",
      "name": "Recharge",
      "isNonstandard": true
    },
    "thiccerfat": {
      "desc": "If a Pokemon uses a Fire- or Ice-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon. This Pokemon cannot be burned. Gaining this Ability while burned cures it.",
      "shortDesc": "Fire/Ice damage against this Pokemon has a halved attacking stat. Burn immunity.",
      "id": "thiccerfat",
      "name": "Thiccer Fat",
      "isNonstandard": true,
      "onModifyAtkPriority": 6,
      "onModifySpAPriority": 5
    },
    "galewingsv1": {
      "desc": "This Pokemon's Flying-type moves have their priority increased by 1.",
      "shortDesc": "This Pokemon's Flying-type moves have their priority increased by 1.",
      "id": "galewingsv1",
      "name": "Gale Wings v1",
      "isNonstandard": true
    },
    "solarflare": {
      "desc": "This Pokemon is immune to Rock-type moves and restores 1/4 of its maximum HP, rounded down, when hit by an Rock-type move.",
      "shortDesc": "This Pokemon heals 1/4 of its max HP when hit by Rock moves; Rock immunity.",
      "id": "solarflare",
      "name": "Solar Flare",
      "isNonstandard": true
    },
    "notprankster": {
      "desc": "This Pokemon's status moves have their priority raised by 1.",
      "shortDesc": "This Pokemon's Status moves have priority raised by 1.",
      "id": "notprankster",
      "name": "Not Prankster",
      "isNonstandard": true
    },
    "beastboost2": {
      "desc": "This Pokemon's two highest stats are raised by 1 if it attacks and KOes another Pokemon.",
      "shortDesc": "This Pokemon's 2 highest stats are raised by 1 if it attacks and KOes another Pokemon.",
      "id": "beastboost2",
      "name": "Beast Boost 2",
      "isNonstandard": true
    },
    "deflectiveshell": {
      "desc": "Summons Sunny Day as the user switches in. Non-contact moves deal 2/3 damage to this Pokemon.",
      "shortDesc": "On switch-in, summons Sunny Day. Receives 2/3 damage from non-contact moves.",
      "id": "deflectiveshell",
      "name": "Deflective Shell",
      "isNonstandard": true
    },
    "interdimensional": {
      "desc": "As it switches in, this Pokemon summons Gravity.",
      "shortDesc": "On switch-in, this Pokemon Summons Gravity.",
      "id": "interdimensional",
      "name": "Interdimensional",
      "isNonstandard": true
    },
    "focusenergy": {
      "desc": "This Pokemon gains the Focus Energy effect when it switches in.",
      "shortDesc": "This Pokemon gains the Focus Energy effect when it switches in.",
      "id": "focusenergy",
      "name": "Focus Energy",
      "isNonstandard": true
    },
    "snowstorm": {
      "desc": "As it switches in, this Pokemon summons hail that remains in effect until replaced by another weather or suppressed by the effects of Cloud Nine, Air Lock, or Delta Stream.",
      "shortDesc": "On switch-in, this Pokemon summons hail which remains active until replaced.",
      "id": "snowstorm",
      "name": "Snow Storm",
      "isNonstandard": true
    },
    "illusion": {
      "inherit": true
    },
    "prankster": {
      "inherit": true
    }
  }
}
