{
  "Abilities": {
    "seasonsgift": {
      "desc": "If Sunny Day is active, this Pokemon's Attack is 1.5x and its Speed is doubled.",
      "shortDesc": "If Sunny Day is active, this Pokemon's Attack is 1.5x and its Speed is doubled.",
      "name": "Season's Gift",
      "isNonstandard": "Custom"
    },
    "dummythicc": {
      "desc": "This ability gives the effects of the abilities Fur Coat, Magic Bounce, Infiltrator, and Sturdy.",
      "shortDesc": "Fur Coat + Magic Bounce + Infiltrator + Sturdy.",
      "name": "Dummy Thicc",
      "isNonstandard": "Custom",
      "onModifyDefPriority": 6,
      "onTryHitPriority": 1,
      "onDamagePriority": -100,
      "condition": {
        "duration": 1
      }
    },
    "awakening": {
      "desc": "On switch-in, Attack and Speed are lowered by three stages, while Defense and Special Defense are increased by three stages. At the end of each turn, Attack and Speed are increased by one stage while Defense and Special Defense are decreased by one stage.",
      "shortDesc": "Atk & Spe -3; Def & SpD +3; each turn: Atk & Spe +1; Def & SpD -1.",
      "name": "Awakening",
      "isNonstandard": "Custom",
      "onResidualOrder": 26,
      "onResidualSubOrder": 1
    },
    "toxicswap": {
      "desc": "On switch-in, this Pokemon swaps all stat changes with the foe. Ignores abilities.",
      "shortDesc": "On switch-in, swaps all stat changes with foe. Ignores abilities.",
      "isNonstandard": "Custom",
      "name": "Toxic Swap"
    },
    "neutralizingspores": {
      "desc": "Nullifies all abilities while on the field.",
      "shortDesc": "Nullifies all abilities while on the field.",
      "name": "Neutralizing Spores",
      "isNonstandard": "Custom"
    },
    "osolemio": {
      "desc": "If Sunny Day is active, this Pokemon restores 1/16 of its maximum HP, rounded down, at the end of each turn.",
      "shortDesc": "If Sunny Day is active, this Pokemon heals 1/16 of its max HP each turn.",
      "name": "O SOLE MIO",
      "isNonstandard": "Custom"
    },
    "volcanictempest": {
      "desc": "On switch-in, this Pokemon summons Lava Terrain.",
      "shortDesc": "On switch-in, this Pokemon summons Lava Terrain.",
      "name": "Volcanic Tempest",
      "isNonstandard": "Custom"
    },
    "distortionworld": {
      "desc": "For 5 turns, Speed becomes the same for all Pokemon. The power of Ghost-type attacks made by Pokemon is multiplied by 1.5.",
      "shortDesc": "5 turns. Speed ties. +Ghost power.",
      "name": "Distortion World",
      "isNonstandard": "Custom"
    },
    "careless": {
      "desc": "This Pokemon blocks certain status moves and instead uses them against the original user. This Pokemon also ignores other Pokemon's Attack, Special Attack, and accuracy stat stages when taking damage, and ignores other Pokemon's Defense, Special Defense, and evasiveness stat stages when dealing damage.",
      "shortDesc": "Bounces certain status moves and ignores other Pokemon's stat changes.",
      "name": "Careless",
      "isNonstandard": "Custom",
      "onTryHitPriority": 1,
      "condition": {
        "duration": 1
      }
    },
    "logia": {
      "desc": "If this Pokemon is an Arceus, its type changes to match its held Plate or Z-Crystal, and it is immune to Normal and same-type moves.",
      "shortDesc": "Arceus: type matches held Plate or Z-Crystal; immunity to Normal and its own type.",
      "name": "Logia",
      "isNonstandard": "Custom"
    },
    "arabesque": {
      "name": "Arabesque",
      "desc": "On switch-in, this Pokemon switches to a different Oricorio forme.",
      "shortDesc": "On switch-in, this Pokemon switches to a different Oricorio forme.",
      "isNonstandard": "Custom"
    },
    "gracideamastery": {
      "desc": "If this Pokemon is Shaymin-Sky, it will transform into Shaymin before using a status move or upon being attacked. After using the move or taking attack damage, if this Pokemon was originally in its base forme, it will transform back into Shaymin-Sky.",
      "shortDesc": "Transforms into Shaymin when using status moves/being attacked.",
      "name": "Gracidea Mastery",
      "isNonstandard": "Custom"
    },
    "seraphicregeneration": {
      "desc": "When this Pokemon switches out, it regains 33% of its HP, then its replacement recovers 33% of its HP.",
      "shortDesc": "Upon switching out, this Pokemon and its replacement regain 33% of their HP.",
      "name": "Seraphic Regeneration",
      "isNonstandard": "Custom",
      "condition": {
        "duration": 1,
        "onSwitchInPriority": -1
      }
    },
    "shadowartifice": {
      "desc": "Prevents adjacent opposing Pokemon from choosing to switch out unless they are immune to trapping or also have this ability or Shadow Tag. If this Pokemon is knocked out with an attack, that attack's user loses HP equal to the amount of damage inflicted on this Pokemon.",
      "shortDesc": "Prevents adjacent foes from switching. If KOed, that move's user loses equal HP.",
      "name": "Shadow Artifice",
      "onDamagingHitOrder": 1
    },
    "miraclescale": {
      "desc": "This Pokemon's Dragon-type moves have their priority increased by 1.",
      "shortDesc": "+1 Priority to Dragon-type moves.",
      "name": "Miracle Scale",
      "isNonstandard": "Custom"
    },
    "radioactive": {
      "desc": "If this Pokemon has a major status condition, its Attack is 1.5x; ignores burn halving physical damage. This Pokemon heals 1/8 of its max HP when poisoned.",
      "shortDesc": "1.5x Atk if statused. Heals 1/8 if poisoned.",
      "name": "Radioactive",
      "isNonstandard": "Custom",
      "onDamagePriority": 1
    },
    "iceabsorb": {
      "desc": "This Pokemon is immune to Ice-type moves and restores 1/4 of its maximum HP, rounded down, when hit by an Ice-type move.",
      "shortDesc": "This Pokemon heals 1/4 of its max HP when hit by Ice moves; Ice immunity.",
      "name": "Ice Absorb",
      "isNonstandard": "Custom"
    },
    "starkmountain": {
      "desc": "The user summons Sunny Day when it switches in. In addition, the Base Power of Water-type attacks is multiplied by 0.5 against this Pokemon.",
      "shortDesc": "Summons Sunny Day on switch-in. Base Power of foe's Water moves is halved.",
      "name": "Stark Mountain",
      "isNonstandard": "Custom"
    },
    "giblovepls": {
      "desc": "After being damaged by a contact move, this Pokemon is healed by 20% of its maximum HP and has its Defense raised by one stage.",
      "shortDesc": "Defense +1 and heal 20% after hit by contact move.",
      "name": "Gib love pls"
    },
    "risefromthegases": {
      "desc": "The power of Fire-type and Ground-type attacks against this Pokemon is halved.",
      "shortDesc": "The power of Fire-type and Ground-type attacks is halved against this Pokemon.",
      "name": "Rise from the Gases",
      "isNonstandard": "Custom",
      "onSourceBasePowerPriority": 7
    },
    "trombe": {
      "desc": "On switch-in, this Pokemon summons Light Screen or Reflect and is guaranteed to move first for one turn.",
      "shortDesc": "On switch, 1 screen + priority.",
      "name": "Trombe!",
      "isNonstandard": "Custom"
    },
    "russianrush": {
      "desc": "If Hail is active, this Pokemon's Speed and accuracy are doubled.",
      "shortDesc": "If Hail is active, this Pokemon's Speed and accuracy are doubled.",
      "name": "Russian Rush",
      "isNonstandard": "Custom"
    },
    "mysteryshell": {
      "desc": "If this Pokemon is a Minior in its Meteor forme, it cannot be afflicted by a status condition. This Pokemon cannot be hit with a critical hit.",
      "shortDesc": "Status immunity while in Meteor forme, crit immunity.",
      "name": "Mystery Shell",
      "isNonstandard": "Custom",
      "onCriticalHit": false
    },
    "gzguishark": {
      "desc": "Boosts Attack by one stage upon switch-in or Mega Evolution.",
      "shortDesc": "Boosts Attack by 1 stage upon switch-in/Mega Evolution.",
      "name": "gz guishark",
      "isNonstandard": "Custom"
    },
    "scripter": {
      "desc": "If Scripted Terrain is active, this Pokemon's Speed is doubled and its moves deal 1.5x damage.",
      "shortDesc": "If Scripted Terrain is active, this Pokemon's Speed doubles and it deals 1.5x damage.",
      "name": "Scripter",
      "isNonstandard": "Custom"
    },
    "souleater": {
      "desc": "Attacking moves heal the user by 33% of damage dealt.",
      "shortDesc": "Attacking moves heal the user 33% of damage dealt.",
      "name": "Soul Eater",
      "isNonstandard": "Custom"
    },
    "maelstrom": {
      "desc": "On switch-in, the weather becomes heavy rain that prevents damaging Fire-type moves from executing, in addition to all the effects of Rain Dance. This weather remains in effect until this Ability is no longer active for any Pokemon, or the weather is changed by Delta Stream or Desolate Land. If Rain Dance is active, this Pokemon's Speed is doubled.",
      "shortDesc": "Summons heavy rain, doubled speed in rain.",
      "name": "Maelstrom",
      "isNonstandard": "Custom"
    },
    "flowershield": {
      "shortDesc": "This Pokemon's Special Defense is doubled.",
      "onModifySpDPriority": 6,
      "name": "Flower Shield"
    },
    "kungfupanda": {
      "desc": "This Pokemon's punch-based attacks have their power multiplied by 1.2, and this Pokemon's Speed is raised by one stage after it is damaged by a contact move.",
      "shortDesc": "Punch-based moves have 1.2x power. +1 Spe when a foe makes contact.",
      "name": "Kung Fu Panda",
      "isNonstandard": "Custom",
      "onBasePowerPriority": 8
    },
    "minnesnowta": {
      "desc": "This Pokemon is immune to Ice-type moves. Its Ice- and Electric-type attacks have their power multiplied by 1.2x.",
      "shortDesc": "This Pokemon's Ice and Electric attacks have 1.2x power; Ice immunity.",
      "onBasePowerPriority": 8,
      "name": "Minnesnowta"
    },
    "sightseeing": {
      "desc": "If this Pokemon is a Castform, its type changes to the current weather condition's type, and its moveset changes to the one associated with the current weather, except during Sandstorm and Acid Rain. The user's Defense, Special Attack, Special Defense, Speed, and accuracy are all boosted 1.5x during weather.",
      "shortDesc": "Castform adapts to current weather; in weather, Def, SpA, SpD, Spe, accuracy 1.5x.",
      "name": "Sightseeing",
      "isNonstandard": "Custom"
    },
    "standuptall": {
      "desc": "This Pokemon's Attack, Defense, and Special Defense are raised by one stage at the end of each full turn it is on the field.",
      "shortDesc": "Raises Atk, Def, and SpD by 1 at the end of each full turn on the field.",
      "name": "Stand Up Tall",
      "isNonstandard": "Custom",
      "onResidualOrder": 26,
      "onResidualSubOrder": 1
    },
    "prismaticsurge": {
      "desc": "On switch-in, this Pokemon summons Prismatic Terrain.",
      "shortDesc": "On switch-in, this Pokemon summons Prismatic Terrain.",
      "name": "Prismatic Surge",
      "isNonstandard": "Custom"
    },
    "shellshocker": {
      "desc": "This Pokemon's Normal-type moves become Electric-type and have 1.2x power. In addition, this Pokemon is immune to Electric-type moves and heals 1/4 of its maximum HP, rounded down, when hit by an Electric-type move.",
      "shortDesc": "Normal-type moves become Electric with 1.2x power; Electric hits heal 1/4 max HP.",
      "name": "Shell Shocker",
      "isNonstandard": "Custom",
      "onModifyMovePriority": -1,
      "onBasePowerPriority": 8
    },
    "acidrain": {
      "desc": "On switch-in, this Pokemon summons Acid Rain.",
      "shortDesc": "On switch-in, this Pokemon summons Acid Rain.",
      "name": "Acid Rain"
    },
    "optimize": {
      "desc": "This Pokemon changes forme and sets depending on which attack it uses, before the attack takes place. If this Pokemon uses Psycho Boost, it first changes to its Attack forme. If this Pokemon uses Recover, it first changes to its Defense forme. If this Pokemon uses Extreme Speed, it first changes to its Speed forme. If this Pokemon uses Refactor, it first changes to its Base forme.",
      "shortDesc": "This Pokemon changes forme and set depending on which attack it uses.",
      "name": "Optimize",
      "isNonstandard": "Custom"
    },
    "fatrain": {
      "desc": "This Pokemon summons Rain Dance when it switches in, and its Defense is 2x when Rain is active.",
      "shortDesc": "On switch-in, summons Rain Dance. This Pokemon's Defense is 2x during Rain.",
      "name": "Fat Rain",
      "isNonstandard": "Custom"
    },
    "wrath": {
      "desc": "This Pokemon has its critical hit ratio raised by 1 stage, and its moves have their accuracy multiplied by 1.1.",
      "shortDesc": "This Pokemon's critical hit ratio is raised by 1, and its moves have 1.1x accuracy.",
      "name": "Wrath",
      "isNonstandard": "Custom"
    },
    "superguarda": {
      "desc": "This user's Attack is doubled until it is hit by a super effective attack. If this Pokemon has a major status condition, its Attack is 1.5x; burn halving physical damage is ignored. This Pokemon can only be damaged by direct attacks.",
      "shortDesc": "Atk 2x until hit by SE move. 1.5x Atk if statused. Immune to indirect damage.",
      "name": "Superguarda",
      "isNonstandard": "Custom"
    },
    "recharge": {
      "desc": "Upon switching out, this Pokemon has its major status condition cured and restores 1/3 of its maximum HP, rounded down. When this Pokemon switches in, if it uses an Electric-type attack on the next turn, that attack's power will be doubled.",
      "shortDesc": "Switch-out: cures status + 33% HP. Switch-in: 2x power on Electric move next turn.",
      "name": "Recharge",
      "isNonstandard": "Custom"
    },
    "thiccerfat": {
      "desc": "If a Pokemon uses a Fire- or Ice-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon. This Pokemon cannot be burned. Gaining this Ability while burned cures it.",
      "shortDesc": "Fire/Ice damage against this Pokemon has a halved attacking stat. Burn immunity.",
      "name": "Thiccer Fat",
      "isNonstandard": "Custom",
      "onSourceModifyAtkPriority": 6,
      "onSourceModifySpAPriority": 5
    },
    "numbnumbjuice": {
      "desc": "This Pokemon is immune to volatile statuses.",
      "shortDesc": "This Pokemon is immune to volatile statuses.",
      "name": "Numb Numb Juice"
    },
    "rvs": {
      "desc": "This Pokemon has two random stats except accuracy and evasion raised by one stage and another stat other than accuracy and evasion lowered by one stage at the end of each turn.",
      "shortDesc": "Raises a 2 random stats by 1 and lowers another stat by 1 at the end the turn.",
      "name": "RVS",
      "isNonstandard": "Custom",
      "onResidualOrder": 26,
      "onResidualSubOrder": 1
    },
    "galewingsv1": {
      "desc": "This Pokemon's Flying-type moves have their priority increased by 1.",
      "shortDesc": "This Pokemon's Flying-type moves have their priority increased by 1.",
      "name": "Gale Wings v1",
      "isNonstandard": "Custom"
    },
    "notprankster": {
      "desc": "This Pokemon's status moves have their priority raised by 1.",
      "shortDesc": "This Pokemon's status moves have priority raised by 1.",
      "name": "Not Prankster",
      "isNonstandard": "Custom"
    },
    "beastboost2": {
      "desc": "This Pokemon's two highest stats are raised by one stage if it attacks and KOes another Pokemon.",
      "shortDesc": "The user's 2 highest stats are raised by 1 if it attacks and KOes another Pokemon.",
      "name": "Beast Boost 2",
      "isNonstandard": "Custom"
    },
    "deflectiveshell": {
      "desc": "Summons Sunny Day as the user switches in. Non-contact moves deal 2/3 damage to this Pokemon.",
      "shortDesc": "On switch-in, summons Sunny Day. Receives 2/3 damage from non-contact moves.",
      "name": "Deflective Shell",
      "isNonstandard": "Custom"
    },
    "interdimensional": {
      "desc": "As it switches in, this Pokemon summons Gravity.",
      "shortDesc": "On switch-in, this Pokemon Summons Gravity.",
      "name": "Interdimensional",
      "isNonstandard": "Custom"
    },
    "trashvivwebs": {
      "desc": "This Pokemon's attacking stat is doubled while it uses a Water-type attack. If a Pokemon uses a Fire-type attack against this Pokemon, that Pokemon's attacking stat is halved when calculating the damage to this Pokemon. This Pokemon cannot be burned. Gaining this Ability while burned cures it. Sets Sticky Web the first time it switches in.",
      "shortDesc": "Attack stat using Water 2x; burn immunity; foe's attack using Fire 0.5x; Sticky Web.",
      "onModifyAtkPriority": 5,
      "onModifySpAPriority": 5,
      "name": "TRASH VIV WEBS"
    },
    "clubexpertise": {
      "desc": "This Pokemon's bone moves have their Base Power multiplied by 1.3.",
      "shortDesc": "This Pokemon's bone moves have their power multiplied by 1.3.",
      "name": "Club Expertise",
      "isNonstandard": "Custom",
      "onBasePowerPriority": 8
    },
    "snowstorm": {
      "desc": "As it switches in, this Pokemon summons Hail that remains in effect until replaced by another weather or suppressed by the effects of Cloud Nine, Air Lock, or Delta Stream.",
      "shortDesc": "On switch-in, this Pokemon summons Hail which remains active until replaced.",
      "name": "Snow Storm",
      "isNonstandard": "Custom"
    },
    "illusion": {
      "inherit": true
    },
    "primordialsea": {
      "inherit": true
    }
  }
}
