{
  "BattleAbilities": {
    "aerilate": {
      "inherit": true,
      "desc": "This Pokemon's Normal-type moves become Flying-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.",
      "shortDesc": "This Pokemon's Normal-type moves become Flying type and have 1.3x power."
    },
    "aftermath": {
      "inherit": true
    },
    "anticipation": {
      "inherit": true,
      "desc": "On switch-in, this Pokemon is alerted if any opposing Pokemon has an attack that is super effective against this Pokemon, or an OHKO move. Counter, Metal Burst, and Mirror Coat count as attacking moves of their respective types, Hidden Power counts as its determined type, and Judgment, Natural Gift, Techno Blast, and Weather Ball are considered Normal-type moves."
    },
    "damp": {
      "inherit": true,
      "desc": "While this Pokemon is active, Explosion, Self-Destruct, and the Aftermath Ability are prevented from having an effect.",
      "shortDesc": "Prevents Explosion/Self-Destruct/Aftermath while this Pokemon is active."
    },
    "galewings": {
      "inherit": true,
      "shortDesc": "This Pokemon's Flying-type moves have their priority increased by 1.",
      "rating": 4.5
    },
    "infiltrator": {
      "inherit": true,
      "desc": "This Pokemon's moves ignore substitutes and the opposing side's Reflect, Light Screen, Safeguard, and Mist.",
      "shortDesc": "Moves ignore substitutes and the foe's Reflect, Light Screen, Safeguard, and Mist."
    },
    "ironbarbs": {
      "inherit": true
    },
    "liquidooze": {
      "inherit": true
    },
    "multitype": {
      "inherit": true,
      "shortDesc": "If this Pokemon is an Arceus, its type changes to match its held Plate."
    },
    "mummy": {
      "inherit": true,
      "desc": "Pokemon making contact with this Pokemon have their Ability changed to Mummy. Does not affect the Multitype or Stance Change Abilities."
    },
    "normalize": {
      "inherit": true,
      "desc": "This Pokemon's moves are changed to be Normal type. This effect comes before other effects that change a move's type.",
      "shortDesc": "This Pokemon's moves are changed to be Normal type.",
      "onModifyMovePriority": 1,
      "rating": -1
    },
    "parentalbond": {
      "inherit": true,
      "desc": "This Pokemon's damaging moves become multi-hit moves that hit twice. The second hit has its damage halved. Does not affect multi-hit moves or moves that have multiple targets.",
      "shortDesc": "This Pokemon's damaging moves hit twice. The second hit has its damage halved."
    },
    "pixilate": {
      "inherit": true,
      "desc": "This Pokemon's Normal-type moves become Fairy-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.",
      "shortDesc": "This Pokemon's Normal-type moves become Fairy type and have 1.3x power."
    },
    "prankster": {
      "inherit": true,
      "shortDesc": "This Pokemon's non-damaging moves have their priority increased by 1.",
      "rating": 4.5
    },
    "refrigerate": {
      "inherit": true,
      "desc": "This Pokemon's Normal-type moves become Ice-type moves and have their power multiplied by 1.3. This effect comes after other effects that change a move's type, but before Ion Deluge and Electrify's effects.",
      "shortDesc": "This Pokemon's Normal-type moves become Ice type and have 1.3x power."
    },
    "roughskin": {
      "inherit": true
    },
    "stancechange": {
      "inherit": true,
      "onBeforeMovePriority": 11
    },
    "weakarmor": {
      "inherit": true,
      "desc": "If a physical attack hits this Pokemon, its Defense is lowered by 1 stage and its Speed is raised by 1 stage.",
      "shortDesc": "If a physical attack hits this Pokemon, Defense is lowered by 1, Speed is raised by 1.",
      "rating": 0.5
    },
    "zenmode": {
      "inherit": true,
      "desc": "If this Pokemon is a Darmanitan, it changes to Zen Mode if it has 1/2 or less of its maximum HP at the end of a turn. If Darmanitan's HP is above 1/2 of its maximum HP at the end of a turn, it changes back to Standard Mode. If Darmanitan loses this Ability while in Zen Mode, it reverts to Standard Mode immediately."
    }
  }
}
